tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Cross-platform make
brew "cmake"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Manage compile and link flags for libraries
brew "pkg-config"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt@5"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# UNIX shell (command interpreter)
brew "zsh"
# Voice and text chat software
cask "discord"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# OpenJDK distribution from Azul
cask "zulu17"
# OpenJDK distribution from Azul
cask "zulu8"
