tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Cross-platform make
brew "cmake"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Manage compile and link flags for libraries
brew "pkg-config"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Port scanning utility for large networks
brew "nmap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Cross-platform application and UI framework
brew "qt@5"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# UNIX shell (command interpreter)
brew "zsh"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# OpenJDK distribution from Azul
cask "zulu17"
# OpenJDK distribution from Azul
cask "zulu8"
